/*
Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125
*/










int  h, c = 0;
    int (a[3], g[3]);
    int i, v, f;
    printf("Введите координаты по оси x , y, z для точки А  :\n");
    for(i = 0; i < 3; i++)
    {
        scanf("%f", &a[i]);
    }